<html>
<head>
<link rel="stylesheet" type="text/css" href="xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->
<H2>Funktionalit&auml;t - In aller K&uuml;rze </H2>
<h3>Was JAP NICHT (!!) ist</h3>
<ul>
  <li>JAP macht die IP-Adresse Ihres Rechners (!) NICHT unsichtbar</li>
  <li>JAP ist KEIN Filesharing-Anonymisierungstool</li>
  <li>JAP kann KEINE E-Mails anonymisieren (au&szlig;er Web-Mailer) </li>
  <li>JAP bindet sich NICHT transparent in Ihr Betriebssystem ein, sondern muss f&uuml;r jede anonymisierte Anwendung extra <a href="browser_de.html">konfiguriert</a> werden </li>
  <li>JAP beschleunigt NICHT Ihren Internetzugriff </li>
  <li>JAP ist NICHT AN.ON (AN.ON ist der angebotene Dienst, JAP die Client-Anwendung zum Zugriff auf den Dienst)</li>
  <li>JAP kann KEINE beliebigen &quot;anonymen&quot; Proxies (z.B. von Listen offener Proxies) nutzen, um eine anonyme Verbindung herzustellen. Dies funktioniert ausschlie&szlig;lich mit AN.ON-Mix-Kaskaden, die <a href="certificates_de.html">zertifiziert</a> sind, automatisch im JAP gelistet werden und nicht extra eingetragen werden m&uuml;ssen. </li>
  <li>JAP wechselt NICHT regelm&auml;&szlig;ig die IP-Adresse, sondern  beh&auml;lt die gleiche IP-Adresse, solange er mit derselben Mix-Kaskade verbunden ist. Dies k&ouml;nnen Minuten, Stunden oder auch Tage sein. </li>
  <li>JAP ist keine Ein-Klick-Anonymisierungsanwendung - so etwas kann und wird es auch nicht wirklich geben! </li>
  <li>JAP filtert (noch) KEINE <a href="noactive_de.html">Skripte oder Browserinformationen</a> </li>
</ul>
<h3>Was JAP ist</h3>
<ul>
  <li>JAP ist eine Anwendung zur Verschleierung der eigenen IP-Adresse bei Webzugriffen &uuml;ber anonymisierte Anwendungen (<a href="supportedPrograms_de.html">HTTP, FTP-Downloads</a>)</li>
  <li> JAP ist eine Anti-Zensur-Anwendung (speziell &uuml;ber <a href="forwarding_server_de.html">Fowarding-Server</a>/<a href="forwarding_client_de.html">Forwarding-Client</a>), die den Zugriff auf ansonsten gesperrte Internetseiten erm&ouml;glicht </li>
  <li>JAP ist quelloffen</li>
  <li>JAP ist kostenlos</li>
  <li>JAP ist f&uuml;r praktisch alle Betriebssysteme verf&uuml;gbar</li>
  <li>JAP darf von jedermann verwendet (auch kommerziell, au&szlig;er der Name) und ver&auml;ndert werden</li>
  <li>JAP wird in Zusammenarbeit mit deutschen Universit&auml;ten (<a href="http://dud.inf.tu-dresden.de">TU Dresden</a>, <a href="http://www-sec.uni-regensburg.de">Universit&auml;t Regensburg</a>) weiterentwickelt</li>
</ul>
<h3>Was AN.ON ist </h3>
<ul>
  <li>AN.ON ist die Bezeichnung f&uuml;r den Anonymisierungsdienst, auf den JAP zugreift </li>
  <li>AN.ON besteht aus vielen Mix-Kaskaden unterschiedlicher L&auml;nge (2-4 Mixe) mit jeweils unterschiedlichen und unabh&auml;ngigen Organisationen als Betreiber der einzelnen Mixe </li>
  <li>Eine von den Betreibern unabh&auml;ngige AN.ON-Dachorganisation (ebenfalls AN.ON genannt) wacht &uuml;ber die Seriosit&auml;t der einzelnen Betreiberorganisationen </li>
  <li>AN.ON wird zum Teil kostenpflichtig betrieben, um die Weiterentwicklung der Software, den Erhalt der Dachorganisation, und die Kosten f&uuml;r den Serverbetrieb zu decken</li>
</ul>
</body>
</html>