<!--#include virtual="/header.html"-->

<H2>InfoService</H2>

<P>
Der InfoService wird verwendet, um den JAP mit notwendigen Informationen
&uuml;ber den Anonymit&auml;tsdienst zu versorgen. Dazu z&auml;hlen z.Z.:

<UL>
	<LI> Die aktuelle Versionsnummer des JAP, um eine automatische
	Aktualisierung zu erm&ouml;glichen.
	<LI> Die Adresse des ersten Mixes.
	<LI> Informationen &uuml;ber die Mixkaskade z.B. die &ouml;ffentlichen
	Schl&uuml;ssel der Mixe.
	<LI> Informationen &uuml;ber die Auslastung des Dienstes und die dadurch
	erreichte Anonymit&auml;t.
</UL>

Bitte beachten Sie, dass die korrekten Informationen zum InfoService bereits voreingestellt sind. Eine &Auml;nderung f&uuml;hrt m&ouml;glicherweise dazu, dass der JAP den Anonymisierungsdienst nicht mehr erreichen kann.

<P>

<H3>Einstellungen</H3>
<P>
Auf dieser Seite sehen Sie die InfoServices, die Ihrem JAP bekannt sind. Der derzeit bevorzugte InfoService erscheint fett gedruckt. Sie k&ouml;nnen folgende Aktionen durchf&uuml;hren:
<UL>
    <LI><B>Aktualisieren...:</B><BR>
    Hier laden Sie eine neue Liste von InfoServices aus dem Internet herunter.
    <P>
    <LI><B>Als Standard:</B><BR>
    Durch Klicken dieser Schaltfl&auml;che wir der markierte InfoService als bevorzugter InfoService ausgew&auml;hlt.
    <P>
    <LI><B>Hinzuf&uuml;gen...:</B><BR>
    Wenn Sie diese Aktion w&auml;hlen, erscheint ein weiteres Dialogfenster zum manuellen Hinzuf&uuml;gen eines InfoServices:
    <P>
    <UL>
        <LI><B>InfoService Host:</B><BR>
        Tragen Sie hier den Hostnamen oder die IP-Adresse des InfoServices ein, den Sie hinzuf&uuml;gen wollen.
        <P>
        <LI><B>InfoService Port:</B><BR>
        Hier m&uuml;ssen Sie den Port des neuen InfoServices eintragen.
        <P>
        <LI><B>InfoService Name:</B><BR>
        Wenn Sie wollen, k&ouml;nnen Sie hier einen Namen f&uuml;r den neuen InfoService vergeben. Der neue InfoService erscheint dann unter diesem Namen in der Liste der bekannten InfoServices. Wenn Sie dieses Feld frei lassen, erscheint der InfoService als Kombination zwischen Hostname und Port.
        <P>
        <LI><B>Hinzuf&uuml;gen:</B><BR>
        Klicken Sie diesen Knopf, um Ihre Eintragungen zu best&auml;tigen und den neuen InfoService einzutragen.
        <P>
        <LI><B>Abbrechen:</B><BR>  
        Hiermit verwerfen Sie alle Eingaben und kehren zum vorigen Fenster zur&uuml;ck.
    </UL>
    <P>
    <LI><B>Entfernen:</B><BR>
    Wenn Sie diese Schaltfl&auml;che klicken, wird der markierte InfoService aus der Liste der bekannten InfoServices entfernt.
</UL>

<H3>Erweiterte Einstellungen</H3>
<P>
<UL>
    <LI><B>Timeout f&uuml;r InfoService und Update Kommunikation:</B><BR>   
    Tragen Sie hier eine Zahl zwischen 1 und 60 ein. Diese Zahl gibt die Anzahl der Sekunden an, die der JAP auf die Beantwortung einer Anfrage an den InfoService warten soll. Trifft die Antwort nicht innerhalb der eingestellten Zeit ein, so wird der InfoService als nicht verf&uuml;gbar betrachtet.
    <P>
    <LI><B>Deaktiviere automatische InfoService-Anfragen:</B><BR>
    Der JAP versucht an einigen Stellen automatisch eine Verbindung zum InfoService aufzubauen und Abfragen durchzuf&uuml;hren. Wenn dieses Feld markiert ist, unterbleiben diese automatischen Abfragen.
    <P>
    <LI><B>Benutze ausschlie&szlig;lich den Standard-InfoService:</B><BR>
    Normalerweise versucht der JAP, die gew&uuml;nschten Informationen von allen bekannten InfoServices zu erhalten, wenn der Standard-InfoService diese nicht liefern kann. Wenn dieses Feld markiert ist, wird nur der Standard-InfoService abgefragt.
</UL>

<H3>Informationen</H3>
<P>
Hier k&ouml;nnen Sie Informationen &uuml;ber die bekannten InfoServices einsehen. Klicken Sie dazu auf den Namen eines InfoServices und Sie sehen die Informationen im Feld "Zugangsm&ouml;glichkeiten".
<!--#include virtual="/footer.html"-->
