<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <link rel="stylesheet" type="text/css" href="xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header_pt.html"-->
<h2>Interface do Utilizador</h2>
<p>
<b>Activar Anonimato</b>
</p>
<p>Para navegar anonimamente, o
JAP tem de ser iniciado. O bot&atilde;o "Lig." na &aacute;rea
"Anonimato" &nbsp;deve ser activado. Se o processo de
liga&ccedil;&atilde;o tiver &ecirc;xito, a agulha
no&nbsp;&nbsp;Anonym-O-Meter will mostrar&aacute; uma
indica&ccedil;&atilde;o. Al&eacute;m disso, o
n&uacute;mero de utilizadores da mistura em cascata seleccionada
ser&aacute; mostrado.
</p>
<p><b>Anonym-O-Meter</b>
</p>
<p>O&nbsp;Anonym-O-Meter
mostra a carga corrente do servi&ccedil;o de anonimato. Consiste
em:
</p>
<ul>
  <li>&nbsp;N&uacute;mero
dos utilizadores correntemente activos ligados &agrave; Internet
via JAP.&nbsp; </li>
  <li>A
situa&ccedil;&atilde;o do tr&aacute;fego, ou noutras
palavras, a quantidade de dados processados e reencaminhados por
unidade
de tempo pela mistura em cascata. </li>
</ul>
A partir desta informa&ccedil;&atilde;o, podem ser inferidos o
risco de observa&ccedil;&atilde;o e o grau de anonimato. Quanto
maior for o n&uacute;mero de utilizadores activos e o
n&uacute;mero de mensagens enviadas ou recebidas por eles, maior
ser&aacute; o anonimato de cada mensagem individual enviada pela
Internet, dado que potencialmente qualquer utilizador pode ter enviado
a mensagem. Se assumirmos que um atacante controla um certo
n&uacute;mero de utilizadores ou simula falsos utilizadores,
torna-se extremamente dificil para esse atacante controlar todos os
utilizadores &agrave; medida que o seu n&uacute;mero aumenta.
Nas &uacute;ltimas vers&otilde;es do JAP, este tipo de ataque
&eacute; prevenido pelos utilizadores ao registar um "billhete" na
mistura em cascata. Este "bilhete" &eacute; um c&oacute;digo
que usa uma assinatura digital cega.
<p><b>Dados
An&oacute;nimos</b>
</p>
<p>Para
informa&ccedil;&atilde;o do utilizador e para
verifica&ccedil;&atilde;o adicional do funcionamento do JAP, a
quantidade de dados transferidos pelo utilizador via servi&ccedil;o
de anonimato durante a sess&atilde;o corrente &eacute;
mostrada.
</p>
<p><b>Reencaminhador</b>
</p>
<p>Com a&nbsp; <a href="forwarding_server_pt.html">fun&ccedil;&atilde;o
de reencaminhamento</a>, pode
permitir a outros utilizadores do JAP ligarem-se ao servi&ccedil;o
de anonimato atrv&eacute;s do seu sistema. Isto ajuda se os outros
utilizadores do JAP estiverem impedidos de se ligarem ao
servi&ccedil;o de anonimato pelos seus ISP ou governos.<br>
<b>Aten&ccedil;&atilde;o:</b>
H&aacute; o risco de ser suspeito de um crime que outro utilizador
do JAP cometa se o seu sistema for usado como reencaminhador para esse
crime.
</p>
<p><b>Servidor</b>
</p>
<p>Com o JAP, &eacute;
poss&iacute;vel usar v&aacute;rias misturas em cascata para
navegar anonimamente. Com este prop&oacute;sito, pode escolher
qualquer mistura em cascata &agrave; sua vontade. Se n&atilde;o
estiver certo de qual usar, use a que se encontra escolhida por
defeito.&nbsp;<br>
<!--#include virtual="/footer_pt.html"-->
</p>
</body>
</html>
