<link rel="stylesheet" type="text/css" href="xhelpfrms.css">
<!--#include virtual="/header.html"-->

<H2>Die JAP Oberfl&auml;che</H2>

<P>
<B>Anonymit&auml;t aktivieren</B>

<P>
Um anonymes Surfen m&ouml;glich zu machen muss als erstes der JAP gestartet werden. Danach m&uuml;ssen Sie das K&auml;stchen "Ein" unter "Anonymit&auml;t" aktivieren. Wenn der Verbindungsaufbau erfolgreich war erscheint kurz danach ein Zeiger im Anonym-O-Meter. Au&szlig;erdem wird die Nutzerzahl der aktuell gew&auml;hlten Mixkaskade angezeigt.

<P>
<B>Anonym-O-Meter</B>

<P>
Das Anonym-O-Meter informiert den Nutzer &uuml;ber die aktuelle Auslastung des Anonymit&auml;tsdienstes. Im einzelnen sind dies:

<UL>
	<LI>Die Anzahl der momentan aktiven Nutzer, die mit dem Internet verbunden sind und im JAP den anonymen Zugriff aktiviert haben.
	<LI>Die Verkehrssituation, d.h. die Menge der Daten, die von den Mixen der Kaskade pro Zeiteinheit verarbeitet und weitergeleitet werden.
</UL>

Aus diesen Informationen kann ein teilweise subjektives Beobachtungsrisiko und eine erreichbare Anonymit&auml;t abgeleitet werden. Je mehr Nutzer aktiv sind und auch Nachrichten senden bzw. empfangen, um so gr&ouml;&szlig;er ist die Anonymit&auml;tsgruppe jeder einzelnen ins Internet gesendeten Nachricht, da potentiell jeder Nutzer die Nachricht gesendet haben k&ouml;nnte. Nimmt man an, dass der Angreifer eine Anzahl Nutzer kontrolliert bzw. selbst angebliche Nutzer simuliert, so f&auml;llt es ihm mit gr&ouml;&szlig;er werdender Anonyit&auml;tsgruppe um so schwerer, alle bis auf einen Nutzer zu kontrollieren. In sp&auml;teren Versionen soll diese Art Angriff dadurch verhindert werden, dass die Nutzer sich bei den Mixen mit Hilfe sogenannter Tickets, d.h. auf ein Pseudonym ausgestellte digitale Berechtigungsmarken, die mit Hilfe sog. Blinder Digitaler Signaturen gebildet werden, anmelden.
<P>
<B>Eigene anonymisierte Daten</B>

<P>
Zur Information des Nutzers und zur &Uuml;berpr&uuml;fung der Funktionalit&auml;t wird von JAP angezeigt, wie viele Daten der Nutzer in der aktuellen Sitzung bereits über den Anonymit&auml;tsdienst &uuml;bertragen hat.
<P>
<B>Forwarder</B>

<P>
Durch die <A HREF="forwarding_server_de.html">Forwarding-Funktion</A> k&ouml;nnen andere JAP-Benutzer &uuml;ber ihr System eine Verbindung zu einem Anonymisierungsdienst aufbauen. Dies ist hilfreich, wenn der Internetprovider oder eine staatliche Hoheit eines JAP-Benutzers den Zugang zum Anonymisierungsdienst unterbindet.
<BR>
<B>Achtung :</B> Dadurch besteht f&uuml;r Sie die Gefahr in den Verdacht einer Straftat zu geraten, die von einem JAP-Benutzer begangen wurde, der ihr System als Forwarder nutzt.
<P>
<B>Server</B>

<P>
Mit dem JAP ist es m&ouml;glich verschiedene Mixkaskaden zum anonymen Surfen zu benutzen. Hier k&ouml;nnen Sie eine Mixkaskade ihrer Wahl einstellen. Wenn Sie sich dabei nicht sicher sind benutzen Sie einfach die Voreingestellte.
<BR>


<!--#include virtual="/footer.html"-->
