<link rel="stylesheet" type="text/css" href="xhelpfrms.css">
<!--#include virtual="/header.html"-->

<H2>Fehlerbehebung </H2>

<P>
<B>Fehler beim Verbinden mit dem Infoservice</B>

<P>
Wenn Sie versuchen, den anonymen Zugriff zu aktivieren, erscheint die
Meldung: <i>Fehler beim Verbinden mit dem Infoservice</i>.

<UL>
    <li> Bitte kontrollieren Sie die Einstellungen f&uuml;r den Infoservice. Es
    mu&szlig; eingestellt sein: Host:&nbsp;infoservice.inf.tu-dresden.de
    Port:&nbsp;6543. Ist dies nicht der Fall, korrigieren Sie bitte diese
    Einstellungen.
    <li> Bitte kontrollieren Sie, ob die Verbindung mit dem Internet
    funktioniert.
    <li> Bitte &uuml;berpr&uuml;fen Sie, ob Ihr Rechner sich hinter einer
    Firewall befindet. Ist dies der Fall, bitten Sie Ihren Systemadministrator,
    den Port 6543 freizugeben. K&ouml;nnen Sie dies nicht veranlassen,
    k&ouml;nnen Sie den Service z.Z. leider nicht benutzen. In sp&auml;teren
    Versionen ist vorgesehen, die Kommunikation mit dem ersten Mix wahlweise
    &uuml;ber einen HTTP-Proxy zu leiten. Dies w&uuml;rde Ihr Problem
    l&ouml;sen.
    <li> Treffen die obigen Punkte nicht zu, so liegt das Problem
    m&ouml;glicherweise nicht bei Ihnen. In diesem Fall bitten wir Sie,
    sp&auml;ter einen neuen Versuch zu starten.
</ul>

<P>
<B>Fehler beim Verbinden mit dem ersten MIX</B>

<P>
Wenn Sie versuchen den anonymen Zugriff zu aktivieren, erscheint die
Meldung: <i>Fehler beim Verbinden mit dem ersten MIX</i>.

<UL>
    <li> Bitte kontrollieren Sie die Einstellungen f&uuml;r den ersten MIX,
    w&auml;hlen Sie einen anderen Anonymisierungsdienst bzw. laden Sie dessen Adresse neu vom
    InfoService.
    <li> Bitte &uuml;berpr&uuml;fen Sie, ob Ihr Rechner sich hinter einer
    Firewall befindet. Ist dies der Fall, bitten Sie Ihren Systemadministrator,
    die Adresse des Anonymisierungsdienstes (IP-Nummer und Port) freizugeben. K&ouml;nnen Sie
    dies nicht veranlassen, k&ouml;nnen Sie den Service vielleicht trotzdem erreichen,
    indem Sie in der JAP-Konfiguration bei 'Zwangsproxy' die f&uuml;r Sie zutreffenden Daten eintragen.
    <li> Treffen die obigen Punkte nicht zu, so liegt das Problem
    m&ouml;glicherweise nicht bei Ihnen. In diesem Fall bitten wir Sie,
    sp&auml;ter einen neuen Versuch zu starten.
</ul>

<P>
<B>Der Browser funktioniert nicht bzw. nutzt nicht den JAP f&uuml;r
Internetanfragen</B>

<ul>
    <li> Bitte &uuml;berpr&uuml;fen Sie, ob Sie den <A HREF="browser_de.html">Browser</A> richtig
    konfiguriert haben.
    <li> &Uuml;berpr&uuml;fen Sie, ob Sie den <A HREF="interface_de.html">anonymen
    Zugriff</A> aktiviert haben.
    <li> Die Verbindung mit dem Internet funktioniert.
</ul>

<P>
<B>Hilfestellung per E-Mail</B>

<P>
Haben Sie ein anderes Problem, versuchen Sie bitte anhand der <A
HREF="debugging_de.html">Debugging Messages</A> auf der Konsole den Fehler
einzugrenzen. Ist Ihnen dies nicht m&ouml;glich, so schauen Sie bitte auf
der JAP-Webseite <B>http://anon.inf.tu-dresden.de</B> nach, ob die
L&ouml;sung Ihres Problems vielleicht schon beschrieben wurde. Ist dies
nicht der Fall, so senden Sie uns eine E-Mail an folgende Adresse:
<B>jap@inf.tu-dresden.de</B>

<P>
Die E-Mail sollte folgende Informationen enthalten:

<UL>
    <li> Eine genaue Beschreibung des Fehlers und in welchen Situationen er
    auftritt.
    <li> Eine Kopie der auf der Konsole ausgegebenen <A
    HREF="debugging_de.html">Fehlermeldungen</A>. Dazu aktivieren Sie in den
    Einstellungen auf der Karte <B>Verschiedenes</B> bitte alle unter Debugging
    aufgef&uuml;hrten Kontrollk&auml;stchen und setzen das Debuglevel auf 0.
    <li> Eine Angabe, wie Sie mit dem Internet verbunden sind (welcher
    Provider, ob &uuml;ber ein lokales Netz, sind Firewalls vorhanden?)
    <li> Eine E-Mail Adresse, an die wir unsere Antwort senden k&ouml;nnen.
</UL>

<P>
Bitte haben Sie beim Warten auf eine Antwort etwas Geduld. Sollten sehr
viele Probleme auftauchen, so wird die Beantwortung sicherlich einige Zeit
in Anspruch nehmen.

<!--#include virtual="/footer.html"-->
