<!--#include virtual="/header.html"-->

<H2> <A HREF="config_de.html"><IMG SRC="japback.gif" WIDTH="65" HEIGHT="50" 
BORDER="0" ALIGN="MIDDLE"></A> Anonymit&auml;t </H2>

<P>
<B>Den Anonymit&auml;tsdienst nutzen</B>

<P>
Auf der Karte <I>Konfiguration</I> werden im Rahmen <I>Anonymit&auml;t</I> 
die Einstellungen und der aktuelle Status des JAP bez&uuml;glich der 
Verbindung zum Anonymit&auml;tsdienst angegeben. Ist das H&auml;kchen vor 
<B>Anonymen Zugriff aktivieren</B> gesetzt, leitet der JAP alle Anfragen in 
das Internet &uuml;ber den Anonymisierungsdienst. Direkt darunter wird die 
Internetadresse des ersten Mixes angezeigt. Au&szlig;erdem existiert eine 
Statusanzeige, die Auskunft dar&uuml;ber gibt, ober der Dienst nutzbar ist. 
Wollen Sie anonym surfen, mu&szlig; die Ausschrift <I>Status: aktiv</I> 
lauten.

<P>
Bitte beachten Sie, da&szlig; vor dem Aktivieren eine Verbindung zum 
Internet bestehen mu&szlig;, da der JAP eine dauerhafte verbindung zum 
ersten MIX aufbaut. Da diese Verbindung auch dann bestehen bleibt, wenn Sie 
keine Anfragen stellen und au&szlig;erdem regelm&auml;&szlig;ig 
Statusinformationen ausgetauscht werden, sollten Sie den anonymen Zugriff 
abschalten, bevor Sie die Verbindung zum Internet trennen.

<P>
Beachten Sie bitte au&szlig;erdem, da&szlig; die automatische Trennung der 
Verbindung nach einer Zeit der Inaktivit&auml;t nicht funktioniert, wenn 
der anonyme Zugriff aktiviert ist. Dies liegt daran, da&szlig; das 
Betriebssystem die Inaktivit&auml;t nicht erkennen kann, da der JAP 
regelm&auml;&szlig;ig Informationen anfordert.

<P>
<B>Konfiguration</B>

<P>
Sie k&ouml;nnen die Adresse des Anonymisierungsdienstes &auml;ndern, wenn 
Sie die Mix-Kaskade wechseln m&ouml;chten. Dazu klicken Sie bitte auf die 
Schaltfl&auml;che <B>&Auml;ndern</B>.

<P>
Sie haben jetzt 3 M&ouml;glichkeiten, einen anderen Anonymit&auml;tsdienst 
auszuw&auml;hlen:

<UL>
	<LI> Sie k&ouml;nnen die lokal gespeicherte Liste der 
	Anonymit&auml;tsdienste von Infoservice aktualisieren lassen. Dazu 
	w&auml;hlen Sie <B>Aus dem Internet laden</B> aus und bet&auml;tigen die 
	Schaltfl&auml;che laden. Dieser Vorgang aktualisiert die lokale Datenbasis.
	<LI> Aus der lokalen Datenbasis k&ouml;nnen Sie einen Anonymisierungsdienst 
	ausw&auml;hlen. Dazu w&auml;hlen Sie <B>Aus lokaler Datenbasis 
	w&auml;hlen</B> und klicken einen der im Ausklappmen&uuml; 
	aufgef&uuml;hrten Anonymisierungsdienste aus.
	<LI> Au&szlig;erdem haben Sie noch die M&ouml;glichkeit die Adresse des 
	Anonymit&auml;tsdienstes manuell einzugeben.
</UL>

<P>
Die manuelle Eingabe des Anonymit&auml;tsservice sowie auch die 
&Auml;nderung der Adresse des Infoservice ist erst dann sinnvoll, wenn es 
alternative Betreiber von Mixkaskaden gibt, die mit diesem Protokoll 
arbeiten. Um den Anonymisierungsdienst zu nutzen, sollten nur die ersten 
beiden Einstellungsm&ouml;glichkeiten verwendet werden.

<!--#include virtual="/footer.html"-->
