<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <link rel="stylesheet" type="text/css" href="xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header_pt.html"-->
<h2>Sobre o Java Anon Proxy</h2>
<p>
<b>Java Anon Proxy (JAP)</b>
</p>
<p>Java Anon Proxy (JAP) possibilita navegar na web sem ser observado.
Isto quer dizer que nem o servidor pedido nem nenhum servidor na
Internet pode saber que utilizador viu determinada p&aacute;gina.
</p>
<p>JAP tem de ser instalado no computador do utilizador para lhe
permitir navegar anonimamente sem ser observado. Isto &eacute;
necess&aacute;rio porque todos os pedidos e todas
as respostas dos servidores s&atilde;o enviadas, n&atilde;o
directamente para o servidor web,
mas atrav&eacute;s de uma Mistura em Cascata. Estas misturas s&atilde;o
esta&ccedil;&otilde;es interpostas,
atrav&eacute;s das quais todas as mensagens s&atilde;o enviadas.
</p>
<p>Como muitos utilizadores usam o sevi&ccedil;o Anon ao mesmo tempo,
as liga&ccedil;&otilde;es de internet de cada um ficam escondidas no
meio das outras; Cada utilizador &eacute; respons&aacute;vel pela sua
liga&ccedil;&atilde;o. Ningu&eacute;m, de fora, outro utilizador ou
mesmo o operador do servi&ccedil;o Anon pode determinar que
liga&ccedil;&otilde;es de internet foram requisitadas por um
determinado utilizador.
</p>
<p><b>O Servi&ccedil;o Anon</b>
</p>
<p>Em geral, pelo menos duas misturas de proxies trabalham no
servi&ccedil;o anon, cada uma
delas operada por uma institui&ccedil;&atilde;o independente que
declarou obrigatoriamente n&atilde;o
armazenar ficheiros log das liga&ccedil;&otilde;es transportadas nem
trocar dados sens&iacute;veis com outros operadores de proxy.
</p>
<p>Contudo, como n&atilde;o se deve confiar plenamente em nenhuma das
esta&ccedil;&otilde;es interpostas
todos os dados enviados s&atilde;o encriptados v&aacute;rias vezes (uma
por esta&ccedil;&atilde;o de mistura).
</p>
<p>A encripta&ccedil;&atilde;o dos pedidos e a
desencripta&ccedil;&atilde;o das respostas ocorrem no programa JAP.
O utilizador apenas tem de <a href="browser_pt.html">configurar</a> o
seu browser
de forma que todos os pedidos sejam direccionados para o JAP.
</p>
<p>O anonimato do Utilizador ocorre atrav&eacute;s do envio de cada
pedido por multi-encripta&ccedil;&atilde;o
atrav&eacute;s de uma s&eacute;rie de esta&ccedil;&otilde;es
interpostas baseadas num conceito de mistura de David Chaum.
Mesmo que, por absurdo, o comportamento de todos os utilizadores fosse
igual
(enviando o a mesma quantidade de dados por unidade de tempo
atrav&eacute;s da mesma mistura
em cascasta), desde que apenas uma mistura n&atilde;o cooperasse com um
atacante global,
n&atilde;o seria poss&iacute;vel reconstruir as ac&ccedil;&otilde;es de
um utilizador individual.
</p>
<p>O nosso objectivo &eacute; fornecer um servi&ccedil;o de acordo com
esses crit&eacute;rios.
</p>
<p><b>Aten&ccedil;&atilde;o!</b> A actual vers&atilde;o ainda
n&atilde;o atingiu esses n&iacute;veis de seguran&ccedil;a, porque
o software est&aacute; em desenvolvimento! Contudo, esta vers&atilde;o
j&aacute; garante um padr&atilde;o de seguran&ccedil;a muito mais
elevado do que os sistemas que trabalham com um &uacute;nico servidor
proxy.
</p>
<p>Esta vers&atilde;o JAP fornece protec&ccedil;&atilde;o contra
atacantes locais
(i.e. o ISP, servidor web, o seu chefe ou patr&atilde;o). Al&eacute;m
disso, fornece protec&ccedil;&atilde;o
contra os operadores de mistura. Dependendo da mistura em que um
operador opera,
ele s&oacute; pode obter informa&ccedil;&atilde;o sobre que
endere&ccedil;o IP usa o servi&ccedil;o <b>ou</b> que pedidos foram
enviados para a web, mas nunca a combina&ccedil;&atilde;o das duas
possibildades.
</p>
<p>A actual vers&atilde;o n&atilde;o fornece protec&ccedil;&atilde;o
contra atacantes que observem todas as linhas
da Internet ou controlem a primeira e a &uacute;ltima mistura.
</p>
<p>Pelas seguintes raz&otilde;es queremos oferecer o sistema antes da
vers&atilde;o final:
</p>
<ul>
  <li> Queremos ganhar experi&ecirc;ncia com um sistema a funcionar com
o objectivo de o poder melhorar. </li>
  <li> Para sermos capazes de oferecer um servi&ccedil;o seguro,
precisamos de um grupo an&oacute;nimo, est&aacute;vel e grande desde o
princ&iacute;pio. Esperamos j&aacute; ter ganho esse grupo e de sermos
capazes de o manter durante o processo de desenvolvimento.
  </li>
</ul>
<p>
Para alcan&ccedil;ar este objectivo, precisamos da sua ajuda.
Ficar-lhe-&iacute;amos muito gratos
se usasse o servi&ccedil;o anon regularmente e nos falasse dos seus
problemas, opini&otilde;es e sugest&otilde;es.
</p>
<p>Pode-nos contactar em <b>jap@inf.tu-dresden.de</b>.
</p>
<p>Para mais informa&ccedil;&atilde;o, veja o website do projecto: <br>
<b>http://www.anon-online.de</b>
<!--#include virtual="/footer_pt.html"--></p>
</body>
</html>
