<html>
<head>
<link rel="stylesheet" type="text/css" href="xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>Bezahlung</H2>

<P>
In diesem Dialog k&ouml;nnen Sie alle Einstellungen vornehmen, die Sie ben&ouml;tigen, um mit einer kostenpflichtigen Kaskade zu surfen.
<P>

<H3>Konten</H3>
<P>
In der Liste sehen Sie die Konten, die Sie bereits angelegt haben. Wenn Sie diesen Dialog zum ersten Mal aufrufen, wird die Liste leer sein.
<p>
Neben der Liste mit den Konten sehen sie das Erstellungsdatum, das Datum der letzten Kontostandsaktualisierung und das G&uuml;ltigkeitsdatum des markierten Kontos. Nach Ablauf des G&uuml;ltigkeitsdatums k&ouml;nnen Sie das Konto nicht mehr aufladen, den bereits eingezahlten Betrag aber noch verbrauchen. Zum erneuten Einzahlen m&uuml;ssen Sie dann ein neues Konto anlegen. 
<p> 
Sie k&ouml;nnen folgende Aktionen durchf&uuml;hren:
<UL>
    <LI><B>Neu:</B><BR>
    Hiermit legen Sie ein neues Konto an. Der Kontoerstellungsprozess kann etwas Zeit in Anspruch nehmen, da hierf&uuml;r ein aufw&auml;ndiger kryptographischer Vorgang gestartet werden muss.<br>
    W&auml;hrend des Erstellungsvorgangs werden Sie aufgefordert, eine Sicherheitsfrage zu beantworten. Bitte folgen Sie dazu den Anweisungen am Bildschirm.<br>
    Wenn Ihr Konto erfolgreich erstellt wurde, erscheint es in der Liste und der Wizard zur Kontoaufladung wird gestartet.
    <P>
    <LI><B>Passwort &auml;ndern:</B><BR>
    Durch Klicken dieser Schaltfl&auml;che k&ouml;nnen Sie ein neues Passwort f&uuml;r die Verschl&uuml;sselung Ihrer Kontodaten angeben. Das Passwort gilt f&uuml;r alle Konten.
    <P>
    <LI><B>Importieren:</B><BR>
    Wenn Sie diese Aktion w&auml;hlen, k&ouml;nnen Sie ein zuvor exportiertes Konto wieder importieren.
<p>
    <LI><B>Ausw&auml;hlen:</B><BR>
    Mit diesem Knopf aktivieren Sie das gew&auml;hlte Konto. Das Konto wird bei der Verbindung zu einer kostenpflichtigen Kaskade zum Bezahlen genutzt.
</UL>

<H3>Informationen zum Kontostand</H3>
<P>
Hier sehen Sie, mit wie vielen Bytes Sie Ihr Konto bereits insgesamt aufgeladen haben. Au&szlig;erdem wird Ihnen der bisherige Gesamtverbrauch und der daraus resultierende aktuelle Kontostand angezeigt.
<P>
Sie k&ouml;nnen folgende Aktionen ausf&uuml;hren:<br> 
<UL>
    <LI><B>Aufladen:</B><BR>
    Hiermit starten Sie einen Wizard, der Sie durch die Schritte zum Aufladen Ihres Kontos f&uuml;hrt.
    <P>
    <LI><B>Aktualisieren:</B><BR>
    Wenn Sie diese Aktion w&auml;hlen, wird der aktuelle Kontostand von der Bezahlinstanz abgefragt. 
    <P>
    <LI><B>Transaktionen:</B><BR>
    Hier k&ouml;nnen Sie sich die letzten Aufladetransaktionen zu Ihrem Konto ansehen.
        <P>
    <LI><B>Exportieren:</B><BR>
    Dieser Knopf speichert Ihre Kontodaten in einer externen Datei.<br> 
    Dies ist  sinnvoll, um bei Datenverlust Ihrer Festplatte oder Neuinstallation von JAP oder des Gesamtsystems wieder Zugriff auf Ihr Konto erhalten zu k&ouml;nnen. Sie sollten die Exportdatei also auf ein externes Medium (z.B. USB-Stick) speichern.<br>
    Es wird empfohlen, ein neu angelegtes Konto zur Sicherung zu exportieren.<br>
    Sie m&uuml;ssen Ihr Konto nicht nach jedem Aufladevorgang exportieren, da der Kontostand bei der Bezahlinstanz gef&uuml;hrt wird. Der Exportvorgang dient vor allem dazu, den Zugriffsschl&uuml;ssel f&uuml;r Ihr Konto zu sichern. Dieser Schl&uuml;ssel &auml;ndert sich nach der Kontoerstellung nicht mehr. 
           <P>
    <LI><B>L&ouml;schen:</B><BR>
    Hiermit l&ouml;schen Sie Ihr Konto.<br>
    <b>ACHTUNG:</b> Sollte sich auf Ihrem Konto noch Guthaben befinden, ist dieses <b>unwiederbringlich verloren!</b> 
</UL>
<!--#include virtual="/footer.html"-->
</body>
</html>