<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <link rel="stylesheet" type="text/css" href="xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header_pt.html"-->
<h2>Servi&ccedil;os</h2>
<p>
</p>
<h3>AN.ON</h3>
<p>Aqui pode encontrar
informa&ccedil;&atilde;o sobre o servi&ccedil;o de
anonimato do projecto AN.ON .
</p>
<ul>
  <li><b>Servi&ccedil;os
dispon&iacute;veis</b><br>
Esta lista cont&eacute;m os nomes de todos os servi&ccedil;os
de anonimato que correntemente podem ser acedidos. O servi&ccedil;o
seleccionado no seu cliente est&aacute; real&ccedil;ado a
negrito. Se clicar no nome do servi&ccedil;o, pode encontrar mais
informa&ccedil;&atilde;o sobre ele.
    <p> </p>
    <ul>
      <li><b>Utilizadores</b><br>
Este campo mostra o n&uacute;mero de utilizadores que
est&atilde;o correntemente ligados ao servi&ccedil;o
seleccionado.
        <p> </p>
      </li>
      <li><b>Acess&iacute;vel
por</b><br>
Aqui pode ver o nome de anfitri&atilde;o ou o endere&ccedil;o
IP atrav&eacute;s do qual o servi&ccedil;o pode ser acedido.
Este endere&ccedil;o deve estar aberto na sua firewall para
liga&ccedil;&otilde;es de sa&iacute;da se quiser usar o
servi&ccedil;o.
        <p> </p>
      </li>
      <li><b>Portas</b><br>
O servi&ccedil;o aceita liga&ccedil;&otilde;es nestes
n&uacute;meros de porta. Pelo menos, uma destas portas necessita de
estar aberta na sua firewall para o endere&ccedil;o anteriormente
referido. </li>
    </ul>
    <p> </p>
  </li>
  <li><b>Recarregar</b><br>
Ao clicar neste bot&atilde;o o JAP pede uma nova lista de
servi&ccedil;os dispon&iacute;veis a partir do InfoService.
    <p> </p>
  </li>
  <li><b>Seleccionar</b><br>
Este bot&atilde;o activa o servi&ccedil;o seleccionado. JAP
tentar&aacute; estabelecer uma liga&ccedil;&atilde;o a este
servi&ccedil;o quando est&aacute; ligado "Lig." na janela
principal.
    <p> </p>
  </li>
  <li><b>Manual</b><br>
Se um servi&ccedil;o n&atilde;o for reconhecido como
dispon&iacute;vel pelo InfoService, pode adicionar manualmente o
servi&ccedil;o com este bot&atilde;o, se conhecer a
informa&ccedil;&atilde;o de "login" para esse
servi&ccedil;o. Depois de clicar no bot&atilde;o, os seguintes
campos aparecer&atilde;o na metade inferior da janela:
    <p> </p>
    <ul>
      <li><b>Anfitri&atilde;o</b><br>
Introduza o nome de anfitri&atilde;o ou o endere&ccedil;o IP do
servi&ccedil;o.
        <p> </p>
      </li>
      <li><b>Porta</b><br>
Introduza o n&uacute;mero da porta do servi&ccedil;o.
        <p> </p>
      </li>
      <li><b>Ok</b><br>
Clique neste bot&atilde;o para introduzir o servi&ccedil;o na
lista de servi&ccedil;os dispon&iacute;veis.
        <p> </p>
      </li>
      <li><b>Cancelar</b><br>
Clique neste bot&atilde;o para&nbsp;cancelar o procedimento e
descartar a informa&ccedil;&atilde;o introduzida. O novo nome
de servi&ccedil;o tamb&eacute;m &eacute; descartado da
lista.
        <p> </p>
      </li>
      <li><b>Apagar</b><br>
O bot&atilde;o s&oacute; estar&aacute; activo se tiver
seleccionado um servi&ccedil;o manualmente introduzido na lista de
servi&ccedil;os dispon&iacute;veis. Ao clicar neste
bot&atilde;o, remove o servi&ccedil;o da lista.. </li>
    </ul>
  </li>
</ul>
A parte inferior da janela depende se um servi&ccedil;o manualmente
inserido ou um servi&ccedil;o registado no InfoService foi
seleccionado.
<p>Se seleccionar um
servi&ccedil;o manualmente inserido, pode modificar a sua
configura&ccedil;&atilde;o ou apag&aacute;-lo da lista.
</p>
<p>Se seleccionar um
servi&ccedil;o registado no Infoservice, ver&aacute; a seguinte
informa&ccedil;&atilde;o adicional sobre esse
servi&ccedil;o:
</p>
<ul>
  <li><b>N&uacute;mero
de servidores no servi&ccedil;o</b><br>
Ver&aacute; uma descri&ccedil;&atilde;o gr&aacute;fica
dos servidores individuais do servi&ccedil;o seleccionado. O
n&uacute;mero de &iacute;cones representa o n&ordm; de
servidores. Ao clicar em cada um dos &iacute;cones pode obter a
seguinte informa&ccedil;&atilde;o, que &eacute; listada por
baixo dos &iacute;cones de servidor:
    <p> </p>
    <ul>
      <li><b>Operador</b><br>
Pode ver o nome da organiza&ccedil;&atilde;o que opera o
servidor.
        <p> </p>
      </li>
      <li><b>URL</b><br>
Neste link pode encontrar
mais&nbsp;informa&ccedil;&atilde;o sobre a
organiza&ccedil;&atilde;o operadora do servidor.
        <p> </p>
      </li>
      <li><b>Localiza&ccedil;&atilde;o</b><br>
A localiza&ccedil;&atilde;o geogr&aacute;fica do servidor
&eacute; mostrada. </li>
    </ul>
  </li>
</ul>
<h3>Tor</h3>
Aqui pode encontrar informa&ccedil;&atilde;o e
configura&ccedil;&otilde;es para a rede de anonimato Tor.
<br>
Se quiser usar o JAP para aceder &agrave; rede Tor, necessita de
configurar o JAP como um Socks Proxy no seu browser, em vez de um
HTTP/HTTPS proxy.
<ul>
  <li><b>Nodos
Tor dispon&iacute;veis</b><br>
S&atilde;o mostrados outros computadores que fazem parte da rede
Tor e oferecem liga&ccedil;&atilde;o a essa rede.
    <p> </p>
  </li>
  <li><b>Lista
de busca</b><br>
Este bot&atilde;o obt&eacute;m uma lista actualizada de nodos
Tor correntemente acess&iacute;veis.
    <p> </p>
  </li>
  <li><b>Prefer&ecirc;ncias
para rotas an&oacute;nimas</b><br>
    <p> </p>
    <ul>
      <li><b>N&ordm;
m&iacute;nimo de nodos por liga&ccedil;&atilde;o</b><br>
Aqui pode definir o n&ordm; m&iacute;nimo de nodos Tor pelos
quais uma liga&ccedil;&atilde;o deve ser encaminhada antes de
chegar ao computador de destino. Quantos mais nodos usar, mais efectivo
ser&aacute; o anonimato da liga&ccedil;&atilde;o.&nbsp;
        <p> </p>
      </li>
      <li><b>N&ordm;
m&aacute;ximo de nodos por liga&ccedil;&atilde;o</b><br>
Aqui pode definir o n&ordm; m&aacute;ximo de nodos Tor usados
numa liga&ccedil;&atilde;o. Quanto maior for o n&ordm;,
mais lenta ser&aacute; a liga&ccedil;&atilde;o.
        <p> </p>
      </li>
      <li><b>Mudar
de rota todos os x segundos</b><br>
Aqui pode definir a frequ&ecirc;ncia com que uma nova rota
&eacute; estabelecida. Sempre que este n&uacute;mero de
liga&ccedil;&otilde;es &eacute; estabelecido, a antiga rota
&eacute; descartada e &eacute; estabelecida uma nova rota
atrav&eacute;s da rede Tor.
        <p> </p>
      </li>
      <li><b>pr&eacute;-criar
rotas an&oacute;nimas</b><br>
Se esta caixa for marcada, JAP automaticamente estabelece uma rota
atrav&eacute;s da rede Tor desde o arranque. Se n&atilde;o for
marcada, n&atilde;o &eacute; estabelecida nenhuma rota
at&eacute; ser efectuada uma liga&ccedil;&atilde;o. </li>
    </ul>
  </li>
</ul>
<h3>Geral</h3>
<ul>
  <li><b>Auto
ligar depois do in&iacute;cio do programa&nbsp;</b><br>
Se esta caixa for marcada, JAP automaticamente liga ao
servi&ccedil;o de anonimato depois de ser iniciado.
    <p> </p>
  </li>
  <li><b>Auto
re-ligar ap&oacute;s liga&ccedil;&atilde;o &agrave;
mistura ter sido perdida&nbsp;</b><br>
Marque esta caixa, se quiser que o JAP automaticamente re-ligue ao
servi&ccedil;o de anonimato se a liga&ccedil;&atilde;o se
perder.
    <p> </p>
  </li>
  <li><b>Enviar
pacote dummy todos os x segundos</b><br>
Pode decidir se falsos pacotes sem conte&uacute;do devem ser
enviados e com que frequ&ecirc;ncia. Isto simula
comunica&ccedil;&atilde;o cont&iacute;nua para potenciais
observadores.
    <p> </p>
  </li>
  <li><b>Usar
servidores n&atilde;o certificados</b><br>
Se esta caixa for marcada, servidores que n&atilde;o tenham
certificados v&aacute;lidos ser&atilde;o usado para
al&eacute;m daqueles que os t&ecirc;m. Por raz&otilde;es de
seguran&ccedil;a, esta op&ccedil;&atilde;o n&atilde;o
deve ser activada. </li>
</ul>
<!--#include virtual="/footer_pt.html"-->
</body>
</html>
